Revit 2024 API
RebarBendingDetail Methods
The RebarBendingDetail type exposes the following members.
Methods
Name | Description
Create
 Creates a new instance of a bending detail.
GetHost
 Gets a reference to the reinforcement element that this bending detail represent.
GetPosition
 Gets the position of the bending detail relative to its view.
GetRotation
 Gets the rotation angle in radians for the bending detail relative to its view.
IsBendingDetail
 Checks if the input element is a bending detail.
SetHost
 Sets the reinforcement element that will be represented by the input bending detail.
SetPosition
 Sets the position for this bending detail relative to its view.
SetRotation
 Sets the rotation angle in radians for the bending detail relative to its view.
See Also
RebarBendingDetail Class
Autodesk.Revit.DB.Structure Namespace